#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.eks.data.aws_ami.eks_worker_windows: Refreshing state...
module.eks.data.aws_ami.eks_worker: Refreshing state...
module.eks.data.aws_caller_identity.current: Refreshing state...
data.aws_caller_identity.current: Refreshing state...
data.aws_availability_zones.available: Refreshing state...
module.eks.data.aws_partition.current: Refreshing state...
module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state...
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_iam_policy_document.cluster_autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeLaunchConfigurations",
              + "autoscaling:DescribeTags",
              + "ec2:DescribeLaunchTemplateVersions",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerAll"
        }
      + statement {
          + actions   = [
              + "autoscaling:SetDesiredCapacity",
              + "autoscaling:TerminateInstanceInAutoScalingGroup",
              + "autoscaling:UpdateAutoScalingGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerOwn"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "true",
                ]
              + variable = "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled"
            }
        }
    }

  # aws_efs_file_system.home_dirs will be created
  + resource "aws_efs_file_system" "home_dirs" {
      + arn              = (known after apply)
      + creation_token   = (known after apply)
      + dns_name         = (known after apply)
      + encrypted        = (known after apply)
      + id               = (known after apply)
      + kms_key_id       = (known after apply)
      + performance_mode = (known after apply)
      + reference_name   = (known after apply)
      + tags             = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"            = "ncar-binder-home-dirs"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + throughput_mode  = "bursting"
    }

  # aws_efs_mount_target.home_dirs_targets[0] will be created
  + resource "aws_efs_mount_target" "home_dirs_targets" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.home_dirs_targets[1] will be created
  + resource "aws_efs_mount_target" "home_dirs_targets" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.home_dirs_targets[2] will be created
  + resource "aws_efs_mount_target" "home_dirs_targets" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_iam_policy.cluster_autoscaler will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster-autoscaler"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_instance.ecs-optimized will be created
  + resource "aws_instance" "ecs-optimized" {
      + ami                          = "ami-014a2e30da708ee8b"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3a.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "ncar-binder-bastion-instance"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"            = "ncar-binder-efs-mount"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "86b89454e9514035baed8c1e4e067acb90725f2c"
      + volume_tags                  = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.ecs-test will be created
  + resource "aws_security_group" "ecs-test" {
      + arn                    = (known after apply)
      + description            = "Allow SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                  + "71.197.186.34/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ncar-binder-ecs-test"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.home_dirs_sg will be created
  + resource "aws_security_group" "home_dirs_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 2049
            },
        ]
      + name                   = "ncar-binder-home_dirs_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + vpc_id                 = (known after apply)
    }

  # helm_release.aws-node-termination-handler will be created
  + resource "helm_release" "aws-node-termination-handler" {
      + atomic                     = false
      + chart                      = "aws-node-termination-handler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-node-termination-handler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.9.5"
      + wait                       = true

      + set {
          + name  = "serviceAccount.name"
          + value = "iamserviceaccount-ncar-binder-aws-node-termination-handler"
        }
    }

  # helm_release.cluster-autoscaler will be created
  + resource "helm_release" "cluster-autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.3.4"
      + wait                       = true

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = (known after apply)
        }
      + set {
          + name  = "awsRegion"
          + value = "us-west-2"
        }
      + set {
          + name  = "cloudProvider"
          + value = "aws"
        }
      + set {
          + name  = "rbac.create"
          + value = "true"
        }
      + set {
          + name  = "rbac.serviceAccountAnnotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.efs-provisioner will be created
  + resource "helm_release" "efs-provisioner" {
      + atomic                     = false
      + chart                      = "efs-provisioner"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "efs-provisioner"
      + namespace                  = "support"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.11.0"
      + wait                       = true

      + set {
          + name  = "efsProvisioner.awsRegion"
          + value = "us-west-2"
        }
      + set {
          + name  = "efsProvisioner.efsFileSystemId"
          + value = (known after apply)
        }
      + set {
          + name  = "efsProvisioner.path"
          + value = "/home-directories"
        }
      + set {
          + name  = "efsProvisioner.provisionerName"
          + value = "aws.amazon.com/efs"
        }
      + set {
          + name  = "efsProvisioner.storageClass.gidAllocate.enabled"
          + value = "false"
        }
    }

  # kubernetes_namespace.prod will be created
  + resource "kubernetes_namespace" "prod" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-hub-prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.staging will be created
  + resource "kubernetes_namespace" "staging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-hub-staging"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.support will be created
  + resource "kubernetes_namespace" "support" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "support"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_persistent_volume.shared-efs-volume-prod will be created
  + resource "kubernetes_persistent_volume" "shared-efs-volume-prod" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-prod-shared-nfs"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes                     = [
              + "ReadWriteMany",
            ]
          + capacity                         = {
              + "storage" = "1Mi"
            }
          + persistent_volume_reclaim_policy = "Retain"
          + storage_class_name               = "manual-sc"

          + node_affinity {
              + required {
                  + node_selector_term {
                      + match_expressions {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }

                      + match_fields {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }
                    }
                }
            }

          + persistent_volume_source {

              + nfs {
                  + path   = "/ocean.hackweek.io/shared/"
                  + server = (known after apply)
                }
            }
        }
    }

  # kubernetes_persistent_volume.shared-efs-volume-staging will be created
  + resource "kubernetes_persistent_volume" "shared-efs-volume-staging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-staging-shared-nfs"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes                     = [
              + "ReadWriteMany",
            ]
          + capacity                         = {
              + "storage" = "1Mi"
            }
          + persistent_volume_reclaim_policy = "Retain"
          + storage_class_name               = "manual-sc"

          + node_affinity {
              + required {
                  + node_selector_term {
                      + match_expressions {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }

                      + match_fields {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }
                    }
                }
            }

          + persistent_volume_source {

              + nfs {
                  + path   = "/ocean.hackweek.io/shared/"
                  + server = (known after apply)
                }
            }
        }
    }

  # kubernetes_persistent_volume.tutorial-data-volume will be created
  + resource "kubernetes_persistent_volume" "tutorial-data-volume" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-tutorial-data-volume"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes                     = [
              + "ReadOnlyMany",
            ]
          + capacity                         = {
              + "storage" = "1Mi"
            }
          + persistent_volume_reclaim_policy = "Retain"
          + storage_class_name               = "manual-sc"

          + node_affinity {
              + required {
                  + node_selector_term {
                      + match_expressions {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }

                      + match_fields {
                          + key      = (known after apply)
                          + operator = (known after apply)
                          + values   = (known after apply)
                        }
                    }
                }
            }

          + persistent_volume_source {

              + nfs {
                  + path      = "/ocean.hackweek.io/tutorial-data/"
                  + read_only = true
                  + server    = (known after apply)
                }
            }
        }
    }

  # kubernetes_persistent_volume_claim.shared-efs-claim-prod will be created
  + resource "kubernetes_persistent_volume_claim" "shared-efs-claim-prod" {
      + id               = (known after apply)
      + wait_until_bound = false

      + metadata {
          + generation       = (known after apply)
          + name             = "shared-nfs"
          + namespace        = "ncar-binder-hub-prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadWriteMany",
            ]
          + storage_class_name = "manual-sc"
          + volume_name        = "ncar-binder-prod-shared-nfs"

          + resources {
              + requests = {
                  + "storage" = "1Mi"
                }
            }
        }
    }

  # kubernetes_persistent_volume_claim.shared-efs-claim-staging will be created
  + resource "kubernetes_persistent_volume_claim" "shared-efs-claim-staging" {
      + id               = (known after apply)
      + wait_until_bound = false

      + metadata {
          + generation       = (known after apply)
          + name             = "shared-nfs"
          + namespace        = "ncar-binder-hub-staging"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadWriteMany",
            ]
          + storage_class_name = "manual-sc"
          + volume_name        = "ncar-binder-staging-shared-nfs"

          + resources {
              + requests = {
                  + "storage" = "1Mi"
                }
            }
        }
    }

  # kubernetes_persistent_volume_claim.tutorial-data-claim will be created
  + resource "kubernetes_persistent_volume_claim" "tutorial-data-claim" {
      + id               = (known after apply)
      + wait_until_bound = false

      + metadata {
          + generation       = (known after apply)
          + name             = "ncar-binder-tutorial-data-claim"
          + namespace        = "ncar-binder-hub-prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadOnlyMany",
            ]
          + storage_class_name = "manual-sc"
          + volume_name        = "ncar-binder-tutorial-data-volume"

          + resources {
              + requests = {
                  + "storage" = "1Mi"
                }
            }
        }
    }

  # module.eks.data.null_data_source.node_groups[0] will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "node_groups"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "aws_auth"        = (known after apply)
          + "cluster_name"    = "ncar-binder-cluster"
          + "role_CNI_Policy" = (known after apply)
          + "role_Container"  = (known after apply)
          + "role_NodePolicy" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.eks.data.template_file.kubeconfig[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: ${endpoint}
                certificate-authority-data: ${cluster_auth_base64}
              name: ${kubeconfig_name}
            
            contexts:
            - context:
                cluster: ${kubeconfig_name}
                user: ${kubeconfig_name}
              name: ${kubeconfig_name}
            
            current-context: ${kubeconfig_name}
            
            users:
            - name: ${kubeconfig_name}
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: ${aws_authenticator_command}
                  args:
            ${aws_authenticator_command_args}
            ${aws_authenticator_additional_args}
            ${aws_authenticator_env_variables}
        EOT
      + vars     = {
          + "aws_authenticator_additional_args" = ""
          + "aws_authenticator_command"         = "aws-iam-authenticator"
          + "aws_authenticator_command_args"    = <<~EOT
                        - "token"
                        - "-i"
                        - "ncar-binder-cluster"
            EOT
          + "aws_authenticator_env_variables"   = ""
          + "cluster_auth_base64"               = (known after apply)
          + "endpoint"                          = (known after apply)
          + "kubeconfig_name"                   = "eks_ncar-binder-cluster"
        }
    }

  # module.eks.data.template_file.launch_template_userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
      + vars     = (known after apply)
    }

  # module.eks.data.template_file.launch_template_userdata[1] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
      + vars     = (known after apply)
    }

  # module.eks.data.template_file.launch_template_userdata[2] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
      + vars     = (known after apply)
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[1] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 0
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = 100
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "AutoTag_Creator"
              + "propagate_at_launch" = "true"
              + "value"               = "arn:aws:iam::765210042771:user/terraform-bot"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "ncar-binder-cluster-user-spot-eks_asg"
            },
          + {
              + "key"                 = "Owner"
              + "propagate_at_launch" = "true"
              + "value"               = "terraform-bot"
            },
          + {
              + "key"                 = "Project"
              + "propagate_at_launch" = "true"
              + "value"               = "ncar-binder-project"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/enabled"
              + "propagate_at_launch" = "false"
              + "value"               = "true"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/ncar-binder-cluster"
              + "propagate_at_launch" = "false"
              + "value"               = "true"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/node-template/label/hub.jupyter.org/node-purpose"
              + "propagate_at_launch" = "false"
              + "value"               = "user"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/node-template/taint/hub.jupyter.org/dedicated"
              + "propagate_at_launch" = "false"
              + "value"               = "user:NoSchedule"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/ncar-binder-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = 3
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "m5.2xlarge"
                }
              + override {
                  + instance_type = "m4.2xlarge"
                }
              + override {
                  + instance_type = "m5a.2xlarge"
                }
            }
        }
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[2] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 0
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = 100
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "AutoTag_Creator"
              + "propagate_at_launch" = "true"
              + "value"               = "arn:aws:iam::765210042771:user/terraform-bot"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "ncar-binder-cluster-worker-spot-eks_asg"
            },
          + {
              + "key"                 = "Owner"
              + "propagate_at_launch" = "true"
              + "value"               = "terraform-bot"
            },
          + {
              + "key"                 = "Project"
              + "propagate_at_launch" = "true"
              + "value"               = "ncar-binder-project"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/enabled"
              + "propagate_at_launch" = "false"
              + "value"               = "true"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/ncar-binder-cluster"
              + "propagate_at_launch" = "false"
              + "value"               = "true"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/node-template/label/k8s.dask.org/node-purpose"
              + "propagate_at_launch" = "false"
              + "value"               = "worker"
            },
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/node-template/taint/k8s.dask.org/dedicated"
              + "propagate_at_launch" = "false"
              + "value"               = "worker:NoSchedule"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/ncar-binder-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = 2
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "r5.2xlarge"
                }
              + override {
                  + instance_type = "r4.2xlarge"
                }
            }
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "ncar-binder-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + version               = "1.15"

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers_launch_template[0] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ncar-binder-cluster"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_instance_profile.workers_launch_template[1] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ncar-binder-cluster"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_instance_profile.workers_launch_template[2] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ncar-binder-cluster"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ncar-binder-cluster"
      + path                  = "/"
      + tags                  = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ncar-binder-cluster"
      + path                  = "/"
      + tags                  = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_launch_template.workers_launch_template[0] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.eks.aws_launch_template.workers_launch_template[1] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "ncar-binder-cluster-user-spot"
      + tags            = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
              + "Name"            = "ncar-binder-cluster-user-spot-eks_asg"
              + "Owner"           = "terraform-bot"
              + "Project"         = "ncar-binder-project"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
              + "Name"            = "ncar-binder-cluster-user-spot-eks_asg"
              + "Owner"           = "terraform-bot"
              + "Project"         = "ncar-binder-project"
            }
        }
    }

  # module.eks.aws_launch_template.workers_launch_template[2] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "ncar-binder-cluster-worker-spot"
      + tags            = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
              + "Name"            = "ncar-binder-cluster-worker-spot-eks_asg"
              + "Owner"           = "terraform-bot"
              + "Project"         = "ncar-binder-project"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
              + "Name"            = "ncar-binder-cluster-worker-spot-eks_asg"
              + "Owner"           = "terraform-bot"
              + "Project"         = "ncar-binder-project"
            }
        }
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ncar-binder-cluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"            = "ncar-binder-cluster-eks_cluster_sg"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ncar-binder-cluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-cluster-eks_worker_sg"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./kubeconfig_ncar-binder-cluster"
      + id                   = (known after apply)
    }

  # module.eks.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id = (known after apply)
    }

  # module.eks.random_pet.workers_launch_template[0] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.eks.random_pet.workers_launch_template[1] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.eks.random_pet.workers_launch_template[2] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler-aws-cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ncar-binder-cluster-autoscaler"
      + path                  = "/"
      + tags                  = {
          + "AutoTag_Creator" = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Owner"           = "terraform-bot"
          + "Project"         = "ncar-binder-project"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ncar-binder-cluster-autoscaler"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-us-west-2a"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
      + vpc               = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-us-west-2a"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-private"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-public"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-private-us-west-2a"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-private-us-west-2b"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.6.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-private-us-west-2c"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-public-us-west-2a"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-public-us-west-2b"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc-public-us-west-2c"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "172.16.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "AutoTag_Creator"                           = "arn:aws:iam::765210042771:user/terraform-bot"
          + "Name"                                      = "ncar-binder-vpc"
          + "Owner"                                     = "terraform-bot"
          + "Project"                                   = "ncar-binder-project"
          + "kubernetes.io/cluster/ncar-binder-cluster" = "shared"
        }
    }

Plan: 74 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @andersy005, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*